Revit 2026 API

# BackgroundSettings Properties

---

The BackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

BackgroundSettings Class

Autodesk.Revit.DB Namespace